Pandas

In [1]:
import pandas as pd
x=pd.read_csv("C:\\Users\\USER\\Documents\\Overall CGPA.csv")
x

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
0   24070301                NaN                NaN                    NaN
1   24070302                NaN                NaN                    NaN
2   24070303                NaN                NaN                    NaN
3   24070304               4.00               3.96               3.980556
4   24070305               3.23               3.17               3.200833
5   24070306                NaN                NaN               0.000000
6   24070307                NaN               2.78                    NaN
7   24070308               3.28               2.76               3.027222
8   24070309                NaN                NaN               0.000000
9   24070310                NaN                NaN               0.000000
10  24070311               3.07               3.04               3.055417
11  24070312               3.23               2.76               3.001528
12  24070313                NaN               2.45                    NaN
13  24070314                NaN               2.61                    NaN
14  24070315               3.56               3.66               3.608611
15  24070316                NaN                NaN               0.000000
16  24070317               4.00               3.87               3.936806
17  24070318               3.80               3.31               3.561806
18  24070319                NaN                NaN               0.000000
19  24070320               4.00               3.83               3.917361
20  24070321               3.54               3.53               3.535139
21  24070322               3.45               3.49               3.469444
22  24070323                NaN                NaN               0.000000
23  24070324                NaN                NaN               0.000000
24  24070325               3.36               3.21               3.287083
25  24070326               3.63               2.49               3.075833
26  24070327                NaN                NaN               0.000000
27  24070328               3.84               3.91               3.874028
28  24070329               3.34               2.91               3.130972
29  24070330                NaN                NaN               0.000000
30  24070331               3.01               3.26               3.131528
31  24070332                NaN                NaN               0.000000
32  24070333                NaN                NaN               0.000000
33  24070334                NaN                NaN               0.000000
34  24070335                NaN                NaN               0.000000
35  24070336               2.88               3.59               3.225139
36  24070337                NaN                NaN               0.000000
37  24070338                NaN                NaN               0.000000
38  24070339                NaN               2.96                    NaN
39  24070340                NaN                NaN               0.000000
40  24070341                NaN                NaN               0.000000
41  24070342               4.00               4.00               4.000000
42  24070343                NaN                NaN               0.000000
43  24070344                NaN                NaN               0.000000
44  24070345               3.72               3.87               3.792917
45  24070346                NaN                NaN                    NaN
46  24070347                NaN                NaN                    NaN
47  24070348                NaN                NaN                    NaN
48  24070349                NaN                NaN                    NaN
49  24070350                NaN                NaN                    NaN
50  24070351                NaN                NaN                    NaN
51  24070352                NaN                NaN                    NaN
52  24070353                NaN                NaN                    NaN
53  24070354                NaN                NaN                    NaN

In [2]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Roll No                54 non-null     int64
 1   CGPA 1st Semester      19 non-null     float64
 2   CGPA 2nd Semester      23 non-null     float64
 3   Overall CGPA 1st Year  38 non-null     float64
dtypes: float64(3), int64(1)
memory usage: 1.8 KB

In [3]:
x.describe()

,Roll No,CGPA 1st Semester,CGPA 2nd Semester,Overall CGPA 1st Year
count,5.400000e+01,19.000000,23.000000,38.000000
mean,2.407033e+07,3.523158,3.279130,1.731901
std,1.573213e+01,0.358795,0.504137,1.773503
min,2.407030e+07,2.880000,2.450000,0.000000
25%,2.407031e+07,3.255000,2.845000,0.000000
50%,2.407033e+07,3.540000,3.260000,1.500764
75%,2.407034e+07,3.820000,3.745000,3.423854
max,2.407035e+07,4.000000,4.000000,4.000000

In [4]:
x.columns

Index(['Roll No', 'CGPA 1st Semester', 'CGPA 2nd Semester',
       'Overall CGPA 1st Year'],
      dtype='object')

In [5]:
x.shape

(54, 4)

#Retrieving Data from DataFrame

In [6]:
x["CGPA 1st Semester"]

0      NaN
1      NaN
2      NaN
3     4.00
4     3.23
5      NaN
6      NaN
7     3.28
8      NaN
9      NaN
10    3.07
11    3.23
12     NaN
13     NaN
14    3.56
15     NaN
16    4.00
17    3.80
18     NaN
19    4.00
20    3.54
21    3.45
22     NaN
23     NaN
24    3.36
25    3.63
26     NaN
27    3.84
28    3.34
29     NaN
30    3.01
31     NaN
32     NaN
33     NaN
34     NaN
35    2.88
36     NaN
37     NaN
38     NaN
39     NaN
40     NaN
41    4.00
42     NaN
43     NaN
44    3.72
45     NaN
46     NaN
47     NaN
48     NaN
49     NaN
50     NaN
51     NaN
52     NaN
53     NaN
Name: CGPA 1st Semester, dtype: float64

In [7]:
y=x[["CGPA 1st Semester","CGPA 2nd Semester"]]
y

    CGPA 1st Semester  CGPA 2nd Semester
0                 NaN                NaN
1                 NaN                NaN
2                 NaN                NaN
3                4.00               3.96
4                3.23               3.17
5                 NaN                NaN
6                 NaN               2.78
7                3.28               2.76
8                 NaN                NaN
9                 NaN                NaN
10               3.07               3.04
11               3.23               2.76
12                NaN               2.45
13                NaN               2.61
14               3.56               3.66
15                NaN                NaN
16               4.00               3.87
17               3.80               3.31
18                NaN                NaN
19               4.00               3.83
20               3.54               3.53
21               3.45               3.49
22                NaN                NaN
23                NaN                NaN
24               3.36               3.21
25               3.63               2.49
26                NaN                NaN
27               3.84               3.91
28               3.34               2.91
29                NaN                NaN
30               3.01               3.26
31                NaN                NaN
32                NaN                NaN
33                NaN                NaN
34                NaN                NaN
35               2.88               3.59
36                NaN                NaN
37                NaN                NaN
38                NaN               2.96
39                NaN                NaN
40                NaN                NaN
41               4.00               4.00
42                NaN                NaN
43                NaN                NaN
44               3.72               3.87
45                NaN                NaN
46                NaN                NaN
47                NaN                NaN
48                NaN                NaN
49                NaN                NaN
50                NaN                NaN
51                NaN                NaN
52                NaN                NaN
53                NaN                NaN

In [8]:
p = x.copy()
p

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
0   24070301                NaN                NaN                    NaN
1   24070302                NaN                NaN                    NaN
2   24070303                NaN                NaN                    NaN
3   24070304               4.00               3.96               3.980556
4   24070305               3.23               3.17               3.200833
5   24070306                NaN                NaN               0.000000
6   24070307                NaN               2.78                    NaN
7   24070308               3.28               2.76               3.027222
8   24070309                NaN                NaN               0.000000
9   24070310                NaN                NaN               0.000000
10  24070311               3.07               3.04               3.055417
11  24070312               3.23               2.76               3.001528
12  24070313                NaN               2.45                    NaN
13  24070314                NaN               2.61                    NaN
14  24070315               3.56               3.66               3.608611
15  24070316                NaN                NaN               0.000000
16  24070317               4.00               3.87               3.936806
17  24070318               3.80               3.31               3.561806
18  24070319                NaN                NaN               0.000000
19  24070320               4.00               3.83               3.917361
20  24070321               3.54               3.53               3.535139
21  24070322               3.45               3.49               3.469444
22  24070323                NaN                NaN               0.000000
23  24070324                NaN                NaN               0.000000
24  24070325               3.36               3.21               3.287083
25  24070326               3.63               2.49               3.075833
26  24070327                NaN                NaN               0.000000
27  24070328               3.84               3.91               3.874028
28  24070329               3.34               2.91               3.130972
29  24070330                NaN                NaN               0.000000
30  24070331               3.01               3.26               3.131528
31  24070332                NaN                NaN               0.000000
32  24070333                NaN                NaN               0.000000
33  24070334                NaN                NaN               0.000000
34  24070335                NaN                NaN               0.000000
35  24070336               2.88               3.59               3.225139
36  24070337                NaN                NaN               0.000000
37  24070338                NaN                NaN               0.000000
38  24070339                NaN               2.96                    NaN
39  24070340                NaN                NaN               0.000000
40  24070341                NaN                NaN               0.000000
41  24070342               4.00               4.00               4.000000
42  24070343                NaN                NaN               0.000000
43  24070344                NaN                NaN               0.000000
44  24070345               3.72               3.87               3.792917
45  24070346                NaN                NaN                    NaN
46  24070347                NaN                NaN                    NaN
47  24070348                NaN                NaN                    NaN
48  24070349                NaN                NaN                    NaN
49  24070350                NaN                NaN                    NaN
50  24070351                NaN                NaN                    NaN
51  24070352                NaN                NaN                    NaN
52  24070353                NaN                NaN                    NaN
53  24070354                NaN                NaN                    NaN

To access a specific row of data pandas provides the .loc method

In [9]:
x.loc[3]

Roll No                  2.407030e+07
CGPA 1st Semester        4.000000e+00
CGPA 2nd Semester        3.960000e+00
Overall CGPA 1st Year    3.980556e+00
Name: 3, dtype: float64

In [10]:
x.head(5)

    Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
0  24070301                NaN                NaN                    NaN
1  24070302                NaN                NaN                    NaN
2  24070303                NaN                NaN                    NaN
3  24070304               4.00               3.96               3.980556
4  24070305               3.23               3.17               3.200833

In [11]:
x.tail(5)

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
49  24070350                NaN                NaN                    NaN
50  24070351                NaN                NaN                    NaN
51  24070352                NaN                NaN                    NaN
52  24070353                NaN                NaN                    NaN
53  24070354                NaN                NaN                    NaN

In [12]:
x.at[0,"CGPA 1st Semester"]

np.float64(nan)

In [13]:
x.loc[14:25]

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
14  24070315               3.56               3.66               3.608611
15  24070316                NaN                NaN               0.000000
16  24070317               4.00               3.87               3.936806
17  24070318               3.80               3.31               3.561806
18  24070319                NaN                NaN               0.000000
19  24070320               4.00               3.83               3.917361
20  24070321               3.54               3.53               3.535139
21  24070322               3.45               3.49               3.469444
22  24070323                NaN                NaN               0.000000
23  24070324                NaN                NaN               0.000000
24  24070325               3.36               3.21               3.287083
25  24070326               3.63               2.49               3.075833

In [14]:
x.sample(10)

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
35  24070336               2.88               3.59               3.225139
28  24070329               3.34               2.91               3.130972
4   24070305               3.23               3.17               3.200833
17  24070318               3.80               3.31               3.561806
48  24070349                NaN                NaN                    NaN
44  24070345               3.72               3.87               3.792917
18  24070319                NaN                NaN               0.000000
24  24070325               3.36               3.21               3.287083
39  24070340                NaN                NaN               0.000000
0   24070301                NaN                NaN                    NaN

Querying and shorting rows

In [15]:
m=x>3
m

    Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
0      True              False              False                  False
1      True              False              False                  False
2      True              False              False                  False
3      True               True               True                   True
4      True               True               True                   True
5      True              False              False                  False
6      True              False              False                  False
7      True               True              False                   True
8      True              False              False                  False
9      True              False              False                  False
10     True               True               True                   True
11     True               True              False                   True
12     True              False              False                  False
13     True              False              False                  False
14     True               True               True                   True
15     True              False              False                  False
16     True               True               True                   True
17     True               True               True                   True
18     True              False              False                  False
19     True               True               True                   True
20     True               True               True                   True
21     True               True               True                   True
22     True              False              False                  False
23     True              False              False                  False
24     True               True               True                   True
25     True               True              False                   True
26     True              False              False                  False
27     True               True               True                   True
28     True               True              False                   True
29     True              False              False                  False
30     True               True               True                   True
31     True              False              False                  False
32     True              False              False                  False
33     True              False              False                  False
34     True              False              False                  False
35     True              False               True                   True
36     True              False              False                  False
37     True              False              False                  False
38     True              False              False                  False
39     True              False              False                  False
40     True              False              False                  False
41     True               True               True                   True
42     True              False              False                  False
43     True              False              False                  False
44     True               True               True                   True
45     True              False              False                  False
46     True              False              False                  False
47     True              False              False                  False
48     True              False              False                  False
49     True              False              False                  False
50     True              False              False                  False
51     True              False              False                  False
52     True              False              False                  False
53     True              False              False                  False

Sorting rows using column values

In [16]:
x.sort_values("CGPA 2nd Semester",ascending=False).head(10)

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
41  24070342               4.00               4.00               4.000000
3   24070304               4.00               3.96               3.980556
27  24070328               3.84               3.91               3.874028
16  24070317               4.00               3.87               3.936806
44  24070345               3.72               3.87               3.792917
19  24070320               4.00               3.83               3.917361
14  24070315               3.56               3.66               3.608611
35  24070336               2.88               3.59               3.225139
20  24070321               3.54               3.53               3.535139
21  24070322               3.45               3.49               3.469444

In [17]:
x.sort_values("CGPA 2nd Semester").head(10)

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
12  24070313                NaN               2.45                    NaN
25  24070326               3.63               2.49               3.075833
13  24070314                NaN               2.61                    NaN
7   24070308               3.28               2.76               3.027222
11  24070312               3.23               2.76               3.001528
6   24070307                NaN               2.78                    NaN
28  24070329               3.34               2.91               3.130972
38  24070339                NaN               2.96                    NaN
10  24070311               3.07               3.04               3.055417
4   24070305               3.23               3.17               3.200833

In [18]:
x.loc[10:15]

     Roll No  CGPA 1st Semester  CGPA 2nd Semester  Overall CGPA 1st Year
10  24070311               3.07               3.04               3.055417
11  24070312               3.23               2.76               3.001528
12  24070313                NaN               2.45                    NaN
13  24070314                NaN               2.61                    NaN
14  24070315               3.56               3.66               3.608611
15  24070316                NaN                NaN               0.000000